README.org
#+TITLE: Doom Configuration
#+author: Dan Girshovich
#+email: dan.girsh@gmail.com
#+PROPERTY: header-args :tangle-mode (identity #o444)

* About

#+begin_quote
“I'm rarely happier than when spending an entire day programming my computer to perform automatically a task that would otherwise take me a good ten seconds to do by hand.” - Douglas Adams
#+end_quote

This is the =.doom.d= submodule of [[https://github.com/dangirsh/neurosys][neurosys]], my complete computing environment.

I use [[emacs.sexy][Emacs]] as the primary interface to my machine and remote machines. In many situations, it replaces CLIs or GUIs with well-designed keyboard-driven interfaces (e.g. [[https://magit.vc/][magit]]). There's no going back.

I use [[https://github.com/hlissner/doom-emacs/][Doom Emacs]] as a base Emacs configuration. This is a literate org file, which specifies and documents the entirety of my Doom configuration. If you link this file to =~/.doom.d/config.org=, Doom will automatically tangle it on startup and whenever it changes.

If you're reading this in a browser, consider opening it in Emacs Org mode for the full experience.

** Inspirations:

- [[https://github.com/jethrokuan/dots/tree/master/.doom.d][Jethro Kuan's dotfiles]]
- [[https://matthewbauer.us/bauer/][bauer: an Emacs+Nix IDE]]
- [[https://ambrevar.xyz/emacs-everywhere/][Pierre Neidhardt: Emacs Everywhere]]
- [[http://doc.rix.si/cce/cce.html][Ryan Rix's Complete Computing Environment (CCE)]]
- [[https://github.com/LemonBreezes/.doom.d/blob/master/config.org][LemonBreezes' Literate Doom Config]]
- [[https://zzamboni.org/post/my-emacs-configuration-with-commentary/][Diego Zamboni's Literate Emacs Config]]
- [[https://justin.abrah.ms/dotfiles/emacs.html][Justin Abrahms' Literate Emacs Config]]

* Table of Contents :QUOTE:TOC_3:
#+BEGIN_QUOTE
- [[#about][About]]
  - [[#inspirations][Inspirations:]]
- [[#doom-module-declarations][Doom Module Declarations]]
- [[#package-configuration][Package Configuration]]
  - [[#header][Header]]
  - [[#global-constants][Global Constants]]
    - [[#contact-info][Contact info]]
    - [[#directories][Directories]]
  - [[#load-helper-functions][Load helper functions]]
  - [[#visual-settings][Visual Settings]]
    - [[#theme][Theme]]
  - [[#key-chord-config][Key Chord Config]]
    - [[#enable-the-key-chord-package][Enable the key chord package]]
    - [[#setup-for-binding-chords-as-leaders][Setup for binding chords as leaders]]
    - [[#define-global-key-chords][Define global key-chords]]
  - [[#hardware-settings][Hardware Settings]]
    - [[#keyboard][Keyboard]]
    - [[#toggle-touchpad][Toggle Touchpad]]
    - [[#display-brightness][Display Brightness]]
    - [[#bluetooth][Bluetooth]]
  - [[#org][Org]]
    - [[#org-noter-syncing-notes-to-pdfs][org-noter: Syncing notes to PDFs]]
    - [[#org-recoll-interface-to-recoll---pdf-content-search][org-recoll: Interface to Recoll - PDF content search]]
    - [[#org-ref-managing-citations][org-ref: Managing citations]]
    - [[#org-journal-managing-daily-journal-files][org-journal: Managing daily journal files]]
    - [[#org-roam-graph-layer-on-top-of-org][org-roam: Graph layer on top of Org]]
    - [[#org-transclusion][org-transclusion]]
    - [[#org-download-inserting-images-into-org-mode][org-download: Inserting images into org-mode]]
    - [[#org-cliplink-better-external-links][org-cliplink: Better external links]]
    - [[#org-drill-spaced-repetition][org-drill: Spaced Repetition]]
    - [[#org-agenda][Org Agenda]]
    - [[#org-sidebar][org-sidebar]]
  - [[#tramp][TRAMP]]
  - [[#effective-editing][Effective Editing]]
    - [[#structure-editing][Structure Editing]]
    - [[#mathpix-ocr-latex-from-images][Mathpix: OCR LaTeX From Images]]
    - [[#multiple-cursors][Multiple Cursors]]
    - [[#undo-tree][Undo Tree]]
  - [[#haskell][Haskell]]
  - [[#rust][Rust]]
    - [[#rustic][Rustic]]
    - [[#org-babel-setup][Org-babel setup]]
    - [[#language-server][Language Server]]
    - [[#evcxr-mode][EVCXR Mode]]
  - [[#jupyter][Jupyter]]
  - [[#ivy][Ivy]]
  - [[#dired][Dired]]
  - [[#search-utilities][Search Utilities]]
    - [[#better-grep][Better Grep]]
    - [[#scanning-occurances-within-a-buffer][Scanning occurances within a buffer]]
  - [[#version-control][Version Control]]
    - [[#magit][Magit]]
  - [[#searching--annotating-pdfs][Searching + Annotating PDFs]]
    - [[#pdf-tools][pdf-tools]]
  - [[#lauching-external-programs][Lauching External Programs]]
  - [[#jumping-between-windows][Jumping between windows]]
  - [[#saving-window-configurations][Saving Window Configurations]]
  - [[#autosave][Autosave]]
  - [[#additional-web-dev-tooling][Additional Web Dev Tooling]]
  - [[#google-translate][Google Translate]]
  - [[#camelcase-to-snake_case-conversion][CamelCase to snake_case conversion]]
  - [[#dotenv][Dotenv]]
  - [[#performance-tweaks][Performance Tweaks]]
    - [[#swiper][Swiper]]
  - [[#extra-load-files][Extra Load Files]]
  - [[#misc-global-keybindings][Misc Global Keybindings]]
  - [[#misc][Misc]]
- [[#utility-functions][Utility functions.]]
  - [[#resume][Resume]]
  - [[#org-1][Org]]
- [[#neurosys-module][Neurosys Module]]
  - [[#globals][Globals]]
  - [[#helpers][Helpers]]
    - [[#deployment][Deployment]]
    - [[#upgrading-02][Upgrading]]
    - [[#misc-1][Misc]]
  - [[#keybindings][Keybindings]]
- [[#package-declarations][Package declarations]]
#+END_QUOTE

* Doom Module Declarations

This file controls what Doom modules are enabled and what order they load in.
Remember to run =doom sync= or =doom/reload=  after modifying it.

#+begin_src emacs-lisp :tangle init.el
;;; init.el -*- lexical-binding: t; -*-

(doom! :input
       ;; :desktop
       ;; exwm

       :personal
       neurosys

       :completion
       (company)
       (ivy +prescient +childframe)

       :ui
       deft
       doom
       hl-todo
       modeline
       nav-flash
       zen

       :editor
       ;; Nice, but messes with org-journal
       lispy
       multiple-cursors
       word-wrap
       format

       :emacs
       dired
       electric
       vc

       :term
       vterm

       :checkers
       syntax

       :tools
       direnv
       (eval +overlay)
       docker
       lookup
       (magit +forge)
       lsp
       pass
       pdf

       :lang
       ;; common-lisp
       data
       emacs-lisp
       go
       ;; javascript
       (haskell +dante)
       ;; (julia +lsp)
       ;; julia
       (latex +latexmk +cdlatex)
       markdown
       nix
       (org
	+journal
	+hugo
	+jupyter
        +roam
	)
       python
       (rust +lsp)
       sh
       yaml

       :app
       ;; calendar

       :config
       literate
       (default +bindings)
       ;; (default +bindings +smartparens)
       )
#+end_src

* Package Configuration
:PROPERTIES:
:header-args: :tangle config.el
:END:
** Header
Set =lexical-binding= for this file.

#+begin_src emacs-lisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

** Global Constants
*** Contact info

Some functionality uses this to identify you, e.g. GPG configuration, email
clients, file templates and snippets.

#+begin_src emacs-lisp
(setq user-full-name "Dan Girshovich"
      user-mail-address (rot13 "qna.tvefu@tznvy.pbz"))
#+end_src

*** Directories

#+begin_src emacs-lisp
(setq my/home-dir "/home/dan/")

(setq my/sync-base-dir (concat my/home-dir "Sync/"))
(setq my/work-base-dir (concat my/home-dir "Work/"))
(setq my/media-base-dir (concat my/home-dir "Media/"))
#+end_src

#+RESULTS:
: /home/dan/Media/

**** Org

#+begin_src emacs-lisp
(setq org-directory my/sync-base-dir
      ;; org-roam-directory "/home/dan/Work/Worldcoin/org-roam"
      org-roam-directory (concat my/sync-base-dir "org-roam/")
      )
#+end_src

#+RESULTS:
: /home/dan/Sync/org-roam/

** Load helper functions

#+begin_src emacs-lisp
(load-file (concat doom-private-dir "funcs.el"))
#+end_src


** Visual Settings

#+begin_src emacs-lisp
(setq doom-font (font-spec :family "Hack" :size 22)
      doom-variable-pitch-font (font-spec :family "Libre Baskerville")
      doom-serif-font (font-spec :family "Libre Baskerville"))

(when (file-exists-p "~/.doom.d/banners")
  (setq +doom-dashboard-banner-padding '(0 . 2)
        +doom-dashboard-banner-file "deepfield-window.png"
        +doom-dashboard-banner-dir "~/.doom.d/banners"))

(setq display-line-numbers-type nil)

;; Thin grey line separating windows
(set-face-background 'vertical-border "grey")
(set-face-foreground 'vertical-border (face-background 'vertical-border))
#+end_src

*** Theme

#+begin_src emacs-lisp
(use-package! doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t      ; if nil, bold is universally disabled
        doom-themes-enable-italic t)   ; if nil, italics is universally disabled
  ;; (load-theme 'doom-acario-light t)
  ;; (load-theme 'leuven t)
  ;; (load-theme 'doom-dark+ t)
  ;; (load-theme 'doom-solarized-light t)
  (load-theme 'doom-one-light t)
  ;; (load-theme 'doom-nord-light t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))


;; Waiting on https://github.com/hlissner/emacs-doom-themes/issues/252
;; Currently, some things like italics and some links in org fail to render correctly.
;; (use-package! poet-theme
;;   :config
;;   (load-theme 'poet))

;; (use-package almost-mono-themes
;;   :config
;;   ;; (load-theme 'almost-mono-black t)
;;   (load-theme 'almost-mono-white t))
#+end_src

** Key Chord Config

I don't use Evil (Vim emulation), which would add an extra layer of complexity
to /everything./ Instead, I heavily leverage key-chord.el, which enables binding
simultaneous key presses (chords) to commands.

I have some custom code to bind chords to Doom's leaders. Many commonly used
commands are bound in these "key chord maps".

*** Enable the key chord package

Set hardware-specific delay. Tweak this if:

- there are false keychords triggered when typing fast (delay too large)
- if expected keychords don't register (delay too small)
- there's a noticable lag when typing normally (delay too large)

#+begin_src emacs-lisp
(use-package! key-chord
  :config
  (key-chord-mode 1)
  (setq key-chord-one-keys-delay 0.02
        key-chord-two-keys-delay 0.03))
#+end_src

*** Setup for binding chords as leaders

#+begin_src emacs-lisp
(defun simulate-seq (seq)
  (setq unread-command-events (listify-key-sequence seq)))

(defun send-doom-leader ()
  (interactive)
  (simulate-seq "\C-c"))

(setq doom-localleader-alt-key "M-c")

(defun send-doom-local-leader ()
  (interactive)
  (simulate-seq "\M-c"))

#+end_src

