config.el

    (setq dk-keymap (make-sparse-keymap))
    (setq sl-keymap (make-sparse-keymap))

    (key-chord-define-global "dk" dk-keymap)
    (key-chord-define-global "sl" sl-keymap)

    (defun add-to-keymap (keymap bindings)
      (dolist (binding bindings)
	      (define-key keymap (kbd (car binding)) (cdr binding))))

    (defun add-to-dk-keymap (bindings)
      (add-to-keymap dk-keymap bindings))

    (defun add-to-sl-keymap (bindings)
      (add-to-keymap sl-keymap bindings))

(add-to-dk-keymap
 '(("." . pop-global-mark)
   ("/" . org-recoll-search)
   ("<SPC>" . rgrep)
   ("b" . my/set-brightness)
   ("c" . my/open-literate-private-config-file)
   ("d" . dired-jump)
   ("k" . doom/kill-this-buffer-in-all-windows)
   ("m" . my/mathpix-screenshot-to-clipboard)
   ("n" . narrow-or-widen-dwim)
   ("o" . ibuffer)
   ("p" . my/publish-dangirsh.org)
   ("r" . my/edit-resume)
   ("s" . save-buffer)
   ("t" . +vterm/here)
   ("v" . neurosys/open-config-file)
   ("w" . google-this-noconfirm)
   ("x" . sp-splice-sexp)))

(key-chord-define-global ",." 'end-of-buffer)
(key-chord-define-global "xz" 'beginning-of-buffer)  ; ergodox
(key-chord-define-global "xc" 'beginning-of-buffer)

(key-chord-define-global "qw" 'delete-window)
(key-chord-define-global "qp" 'delete-other-windows)

(key-chord-define-global "fk" 'other-window)
(key-chord-define-global "jd" 'rev-other-window)

(key-chord-define-global "JJ" 'previous-buffer)
(key-chord-define-global "KK" 'next-buffer)


(key-chord-define-global "hh" 'helpful-at-point)
(key-chord-define-global "hk" 'helpful-key)
(key-chord-define-global "hv" 'helpful-variable)

;; no bueno: e.g. "pathfinder", "highfidelity"
;; (key-chord-define-global "hf" 'helpful-function)

(key-chord-define-global "vn" 'split-window-vertically-and-switch)
(key-chord-define-global "vm" 'split-window-vertically-and-switch)  ; ergodox
(key-chord-define-global "hj" 'split-window-horizontally-and-switch)

(key-chord-define-global "jm" 'my/duplicate-line-or-region)
(key-chord-define-global "fv" 'comment-line)

(key-chord-define-global "kl" 'er/expand-region)

(key-chord-define-global "xx" 'execute-extended-command)
(key-chord-define-global "xf" 'find-file)

(key-chord-define-global "l;" 'repeat)

)

(defun fix-keyboard ()
  (interactive)
  (shell-command "setxkbmap -option 'ctrl:nocaps'")
  (shell-command "xset r rate 160 60"))

(defun toggle-touchpad ()
  (interactive)
  (shell-command "/home/dan/my-config/scripts/toggle_trackpad.sh"))

(defun my/set-brightness (brightness)
  (interactive "nBrightness level: ")
  (save-window-excursion
    (find-file "/sudo:root@localhost:/sys/devices/pci0000:00/0000:00:02.0/drm/card0/card0-eDP-1/intel_backlight/brightness")
    (kill-region
     (point-min)
     (point-max))
    (insert
     (format "%s" brightness))
    (save-buffer)
    (kill-buffer)))

(defun my/connect-to-bose-700s ()
  (interactive)
  (shell-command "bluetoothctl -- connect 4C:87:5D:27:B8:63"))

(defun my/disconnect-to-bose-700s ()
  (interactive)
  (shell-command "bluetoothctl -- disconnect 4C:87:5D:27:B8:63"))

(use-package! org
