README.org
*** For Rust

Had to build =lldb= from source to get =lldb-mi=. Required installing =lldb= and =liblldb-dev= to build.

Hit when debugin with =char= types: [[https://github.com/rust-lang/rust/issues/29154][rust-lang/rust#29154 Floating point exception when debugging with lldb on Mac...]]

#+begin_example
undefinederror: need to add support for DW_TAG_base_type 'char' encoded with DW_ATE = 0x8, bit_size = 32
#+end_example


Also, breaks swiper :(

** Jupyter

#+BEGIN_SRC emacs-lisp
(use-package! jupyter
  :init
  (setq jupyter-eval-use-overlays t)

  (map!
   :map org-mode-map
   :localleader
   (:desc "Jupyter Org Hydra"       "j" #'jupyter-org-hydra/body))

  (defun my/insert-julia-src-block ()
    (interactive)
    (jupyter-org-insert-src-block t current-prefix-arg))

  ;; I locally modified jupyter-completion-at-point to check for this,
  ;; since completions regularly crash the julia kernel for me :/
  (setq my/jupyter-enable-completions nil)

  ;; Better than `M-c C-, j` or `M-c j =`
  (key-chord-define-global "jq" #'my/insert-julia-src-block)
  (map!
   :map julia-mode-map
   :localleader
   (:prefix ("j" . "jupyter")
    :desc "Run REPL"         "o" #'jupyter-run-repl
    :desc "Eval function"    "f" #'jupyter-eval-defun
    :desc "Eval buffer"      "b" #'jupyter-eval-buffer
    :desc "Eval region"      "r" #'jupyter-eval-region
    :desc "Restart REPL"     "R" #'jupyter-repl-restart-kernel
    :desc "Interrupt REPL"   "i" #'jupyter-repl-interrup-kernel
    :desc "Scratch buffer"   "s" #'jupyter-repl-scratch-buffer
    :desc "Remove overlays"  "O" #'jupyter-eval-remove-overlays
    :desc "Eval string"      "w" #'jupyter-eval-string
    :desc "Inspect at point" "d" #'jupyter-inspect-at-point)))
#+END_SRC

** Ivy

Ivy allows you to find the input to a command by incrementally searching the
space of all valid inputs. It's well-supported in Doom.

#+BEGIN_SRC emacs-lisp
(after! ivy
  ;; Causes open buffers and recentf to be combined in ivy-switch-buffer
  (setq ivy-use-virtual-buffers t
        counsel-find-file-at-point t
        ivy-wrap nil
        ivy-posframe-display-functions-alist '((t . ivy-posframe-display-at-frame-top-center))
        ivy-posframe-height-alist '((t . 20))
        ivy-posframe-parameters '((internal-border-width . 1))
        ivy-posframe-width 100)
  (add-hook 'eshell-mode-hook
            (lambda ()
              (eshell-cmpl-initialize)
              (define-key eshell-mode-map (kbd "M-r") 'counsel-esh-history)))
  (add-to-dk-keymap
   '(("g" . +ivy/project-search)
     ("h" . +ivy/projectile-find-file)
     ("i" . counsel-semantic-or-imenu)
     ("j" . ivy-switch-buffer))))

#+END_SRC

** Dired

#+BEGIN_SRC emacs-lisp
(after! dired
  (setq dired-listing-switches "-aBhl  --group-directories-first"
        dired-dwim-target t
        dired-recursive-copies (quote always)
        dired-recursive-deletes (quote top)
        ;; Directly edit permisison bits!
        wdired-allow-to-change-permissions t))

(use-package! dired-narrow
              :commands (dired-narrow-fuzzy)
              :init
              (map! :map dired-mode-map
                    :desc "narrow" "/" #'dired-narrow-fuzzy))

;; Directly edit permisison bits!
(setq wdired-allow-to-change-permissions t)
#+END_SRC

#+RESULTS:
: t

** Search Utilities

*** Better Grep

#+BEGIN_SRC emacs-lisp
(use-package! deadgrep
              :if (executable-find "rg")
              :init
              (map! "M-s" #'deadgrep))
#+END_SRC

*** Scanning occurances within a buffer

This is one of my primary ways of navigating next: jump through other occurances
of the text currently under the cursor.

#+BEGIN_SRC emacs-lisp
(use-package! smartscan
  :init (global-smartscan-mode 1)
  :bind (("M-N" . smartscan-symbol-go-forward)
         ("M-P" . smartscan-symbol-go-backward)
         :map smartscan-map
         ("M-p" . nil)
         ("M-n" . nil)))
#+END_SRC

** Version Control

Disable version control when using TRAMP to avoid extra delays

#+BEGIN_SRC emacs-lisp
(setq vc-ignore-dir-regexp
                (format "\\(%s\\)\\|\\(%s\\)"
                        vc-ignore-dir-regexp
                        tramp-file-name-regexp))
#+END_SRC

*** Magit

Stunningly useful.

#+BEGIN_SRC emacs-lisp
(use-package! magit
  :config
  (set-default 'magit-stage-all-confirm nil)
  (set-default 'magit-unstage-all-confirm nil)

  (remove-hook 'magit-mode-hook 'turn-on-magit-gitflow)

  ;; Restores "normal" behavior in branch view (when hitting RET)
  (setq magit-visit-ref-behavior '(create-branch checkout-any focus-on-ref))

  (setq git-commit-finish-query-functions nil)
  (setq magit-visit-ref-create 1)
  (setq magit-revision-show-gravatars nil))

(after! (magit key-chord)
  (add-to-sl-keymap
   '(("k" . magit-dispatch-popup)
     ("s" . magit-status)
     ("o" . magit-log)
     ("u" . magit-submodule-update)
     ("l" . magit-show-refs-head))))
#+END_SRC

** Searching + Annotating PDFs

*** pdf-tools

#+BEGIN_SRC emacs-lisp
(after! pdf-tools
  ;;swiper doesn't trigger the pdf-isearch
  (map! :map pdf-isearch-minor-mode-map
        "C-s" 'isearch-forward-regexp))
#+END_SRC

*** COMMENT org-noter-pdftools

#+begin_src emacs-lisp
(use-package! org-noter-pdftools
  :after org-noter
  :config
  (with-eval-after-load 'pdf-annot
    (add-hook 'pdf-annot-activate-handler-functions #'org-noter-pdftools-jump-to-note)))
#+end_src

** Lauching External Programs

#+BEGIN_SRC emacs-lisp
(use-package! dmenu)
#+END_SRC

** Jumping between windows

Here we set the window labels to homerow keys (they are numbers by default)

Would use the window-select Doom module, but that (unwantedly in EXWM) binds other-window
to ace-window.

#+begin_src emacs-lisp
(use-package! ace-window
  :config
  (map! "C-M-SPC" #'ace-window)
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
#+end_src

** Saving Window Configurations

#+begin_src emacs-lisp
(use-package! burly)
#+end_src

** Autosave

#+begin_src emacs-lisp
(use-package! real-auto-save
  :hook
  (prog-mode . real-auto-save-mode)
  (org-mode . real-auto-save-mode))
#+end_src

** Additional Web Dev Tooling

Including the Doom =javascript= module does most of the work...

#+begin_src emacs-lisp
(use-package! jest
  :hook
  (typescript-mode . jest-minor-mode))
#+end_src

** Google Translate

#+begin_src emacs-lisp
(use-package google-translate
  :custom
  (google-translate-backend-method 'curl)
  :config
  (defun google-translate--search-tkk () "Search TKK." (list 430675 2721866130))
  (setq google-translate-output-destination 'kill-ring))
#+end_src

** CamelCase to snake_case conversion

#+begin_src emacs-lisp
(use-package! string-inflection)
#+end_src

** Dotenv

#+begin_src emacs-lisp
(use-package! dotenv)
#+end_src

#+begin_src emacs-lisp
(defun my/load-env-file (env-file)
  (interactive "f")
  (dotenv-update-env (dotenv-load% env-file)))
#+end_src

#+RESULTS:
: my/load-env-file

** COMMENT Poly Markdown

Used with *.jmd literate Julia files (see [[http://weavejl.mpastell.com/stable/#Weave.jl-Scientific-Reports-Using-Julia-1][Weave.jl]])

#+begin_src emacs-lisp
(use-package! poly-markdown)
#+end_src

** Performance Tweaks

*** Swiper

Seems like a good solution to swiper being slow is to [[https://oremacs.com/2019/04/07/swiper-isearch/][just use swiper-isearch]], but I find swiper's handling of multiple results on a line more convenient most of the time.

Instead, I follow advice from [[https://www.reddit.com/r/emacs/comments/cfdv1y/swiper_is_extreamly_slow/euamwwt?utm_source=share&utm_medium=web2x][this Reddit comment]] to make swiper ignore visual line mode. Seems to help for now.

#+begin_src emacs-lisp
(setq swiper-use-visual-line nil)
(setq swiper-use-visual-line-p (lambda (a) nil))
#+end_src

** Extra Load Files

#+begin_src emacs-lisp
(load-file "/home/dan/Work/Worldcoin/worldcoin-setup.el")
(require 'worldcoin-setup)
#+end_src


** Misc Global Keybindings

#+BEGIN_SRC emacs-lisp
(map!
 "M-p" (lambda () (interactive) (scroll-down 4))
 "M-n" (lambda () (interactive) (scroll-up 4))

 "C-h h" 'helpful-at-point
 "C-h f" 'helpful-function
 "C-h v" 'helpful-variable
 "C-h k" 'helpful-key

 "M-SPC" 'avy-goto-word-or-subword-1

 "C-s" 'swiper-isearch
 ;; "C-M-s" 'swiper-isearch

 "C-S-d" 'my/duplicate-line-or-region
 "C-c <left>" 'winner-undo
 "C-c <right>" 'winner-redo

 "C-+" 'text-scale-increase
 "C--" 'text-scale-decrease

 ;; FIXME: This currently relies on Helm as an undeclared dep!
 "M-y" 'helm-show-kill-ring

 "C-<f5>" 'my/night-mode
 "C-<f6>" 'my/day-mode

 "C-z"   'undo-fu-only-undo
 "C-S-z" 'undo-fu-only-redo

 "C-/"   'undo-fu-only-undo
 "C-?" 'undo-fu-only-redo)

(global-set-key [remap goto-line] 'goto-line-with-feedback)
(global-set-key [remap goto-line] 'goto-line-with-feedback)

#+END_SRC

